; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v7 - type_3 ?v3 - type_1)
 	      (pred_2 ?v5 - object ?v3 - type_1)
	      (pred_3 ?v7 - type_3 ?v6 - type_2)
	      (pred_4 ?v7 - type_3 ?v5 - object ?v6 - type_2))

   (:action op_1
       :parameters  (?v7 - type_3 ?v1 ?v4 - type_1)
       :precondition (and  (pred_1 ?v7 ?v1))
       :effect (and  (pred_1 ?v7 ?v4)
		     (not (pred_1 ?v7 ?v1))))

   (:action op_2
       :parameters (?v7 - type_3 ?v2 - object ?v8 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v8) (pred_1 ?v7 ?v8) (pred_3 ?v7 ?v6))
       :effect (and (pred_4 ?v7 ?v2 ?v6)
		    (not (pred_2 ?v2 ?v8)) 
		    (not (pred_3 ?v7 ?v6))))

   (:action op_3
       :parameters (?v7 - type_3 ?v2 - object ?v8 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_4 ?v7 ?v2 ?v6) (pred_1 ?v7 ?v8))
       :effect (and (pred_2 ?v2 ?v8)
		    (pred_3 ?v7 ?v6)
		    (not (pred_4 ?v7 ?v2 ?v6)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_3
obj_08 obj_05 - type_2
obj_03 obj_07 obj_04 - type_1
obj_09 obj_06 obj_01 - object)
(:init
(pred_1 obj_02 obj_07)
(pred_3 obj_02 obj_08)
(pred_3 obj_02 obj_05)
(pred_2 obj_09 obj_07)
(pred_2 obj_06 obj_03)
(pred_2 obj_01 obj_04)
)
(:goal
(and
(pred_2 obj_09 obj_07)
(pred_2 obj_06 obj_07)
(pred_2 obj_01 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_02 ?b obj_05))))
)
)

; plan
1. (op_1 obj_02 obj_07 obj_03)
   deleted: (pred_1 obj_02 obj_07)
   added: (pred_1 obj_02 obj_03)
   goals met: 2 of 3
2. (op_2 obj_02 obj_06 obj_03 obj_08)
   deleted: (pred_2 obj_06 obj_03) (pred_3 obj_02 obj_08)
   added: (pred_4 obj_02 obj_06 obj_08)
   goals met: 2 of 3
3. (op_1 obj_02 obj_03 obj_07)
   deleted: (pred_1 obj_02 obj_03)
   added: (pred_1 obj_02 obj_07)
   goals met: 2 of 3
4. (op_3 obj_02 obj_06 obj_07 obj_08)
   deleted: (pred_4 obj_02 obj_06 obj_08)
   added: (pred_2 obj_06 obj_07) (pred_3 obj_02 obj_08)
   goals met: 3 of 3
